/********************************************
学号：
姓名：
********************************************/

/********************************************
一、创建数据库
********************************************/
USE master;
GO

CREATE DATABASE sut_mng 
ON
PRIMARY  
    (NAME = stud,
    FILENAME = 'D:\StudData\Studdat1.mdf',
    SIZE = 100MB,
    MAXSIZE = 200,
    FILEGROWTH = 20)
    
LOG ON 
   (NAME = Studlog,
    FILENAME = 'D:\StudData\Studlog1.ldf',
    SIZE = 100MB,
    MAXSIZE = 200,
    FILEGROWTH = 20)
    ;
GO

USE sut_mng;
GO

/********************************************
二、创建表
********************************************/
CREATE TABLE S(
	Sno CHAR(4),
	Sname CHAR(20),
	Sex CHAR(4) CHECK(Sex IN ('m','f')),
	Birth DATETIME, --出生年月日
	Sdept CHAR(10),
	PRIMARY KEY (Sno),
);
GO

--...........

/********************************************
三、数据更新
********************************************/
INSERT INTO S VALUES('S001','张三','F','1990/12/31','cs');
--...........


/********************************************
四、查询
********************************************/
--3.（P71 6.3）求供应工程J1零件为红色的供应商号码SNO；
--方法一：（连接查询）

--方法二：（IN谓词）

--方法三：（EXISTS谓词）
